汇编语言是一种最接近计算机核心的编码语言。
Q：最接近计算机核心的不是机器语言吗？
不同于任何高级语言，汇编语言几乎可以完全和机器语言一一对应。
汇编语言就是机器语言的一种可以被人读懂的形式，只不过它更容易记忆。
Q:那高级语言是不是比汇编语言更容易被记忆？


学习汇编语言，你需要
1。 胆量。不要害怕去接触那些计算机内部工作机制。
2。 知识。了解计算机常用的数制，特别是二进制、十六进制、八进制，以及计算机保存数据的方法。
3。 开放。接受汇编语言与高级语言的差异，而不是去指责它如何的不好读。
Q:问一下这个汇编语言是只有一种吗？如果汇编语言和一开始人类创造的编程语言一样的话，那么当时的开发者为什么觉得汇编语言难以接受，而今天，我们这些学习的人又需要学汇编语言呢？

典型处理器的主要任务
1。 从内存中获取机器语言指令，译码，执行。
Q：内存指的是RAM，还是ROM呢？如何获取呢？

2。 根据指令代码管理它自己的寄存器。
Q：这段用于管理的指令代码是存放在寄存器中吗？

3。 根据指令或自己的需要修改内存的内容。
4。 响应其他硬件的中断请求。
Q：中断请求是指什么？

寄存器
寄存器位于CPU中，可以保存特定长度的数据。
Q：是否能保存自定义长度的数据？

通用寄存器的表示方法
上图中，数字表示的是位。可以看出，EAX是一个32-bit寄存器。同时，它的低16-bit又可以通过AX这个名字来访问；AX又被分为高、低8-bit两部分，分别由AH和AL表示。
Q：EAX,AX,AH,AL的名字有什么来由吗？那高16-bit又怎么表示？

一个博客的描述：
这些32位寄存器有多种用途，但每一个都有“专长”，有各自的特别之处。

EAX 是"累加器"(accumulator), 它是很多加法乘法指令的缺省寄存器。（缺省代表默认的意思，翻译不好）

EBX 是"基地址"(base)寄存器, 在内存寻址时存放基地址。（既然上面提到EAX也可以作为内存偏移指针的话，是不是EBX，ECX等等都有这样的作用，可不可以存储变量地址?）

ECX 是计数器(counter), 是重复(REP)前缀指令（重复执行后面的指令）和LOOP（循环的意思）指令的内定计数器。

EDX 则总是被用来放整数除法产生的余数。（溢出寄存器是这个意思吗?）

ESI/EDI分别叫做"源/目标索引寄存器"(source/destination index),因为在很多字符串操作指令中, DS:ESI指向源串,而ES:EDI指向目标串.（源地址指针，目的地址指针是什么鬼?能不能说人话?）

EBP是"基址指针"(BASE POINTER), 它最经常被用作高级语言函数调用的"框架指针"(frame pointer). 在破解的时候,经常可以看见一个标准的函数起始代码:


注意，这三个寄存器没有对应的8-bit分组。但可以通过SI、DI，BP分别访问他们的低16位。
（那意思是说这七个寄存器都没有对应的4-bit分组喽？）
Q：保护模式有没有通俗的讲法？具体是指什么？






Q：有实模式，那有虚模式吗？到底有多少种模式？

递归（英语：Recursion），又译为递回，在数学与计算机科学中，是指在函数的定义中使用函数自身的方法。【德罗斯特效应（Droste effect）】

现在的名词：段寄存器，选择器，通用寄存器，特殊寄存器，标志寄存器

注意，一定不要在初学汇编阶段把这些寄存器弄混。段寄存器或选择器，在没有指定的情况下都是使用默认的那个。这句话在现在看来可能有点稀里糊涂，不过你很快会在后面知道如何去做。
（使用默认的哪个？表述不清）

不同的是，实模式下的段选择器是16-bit的，而保护模式下的选择器是32-bit的。
Q：那下面的选择器到底是16-bit的还是32-bit的？

与：按位乘
或：按位取最大值
非： 按位加，但不进位。
异或：相同的取0，不同的取1（完美保密性）

PS:应该是原码吧？那里应该打错了。http://blog.csdn.net/vickyway/article/details/48788769
