1.	汇编：汇编语言就是机器语言的一种，最接近计算机核心的编码语言。（特点：可以被人读懂的形式，它更容易记忆。）

2.	处理器任务：从内存中获取机器语言指令，译码，执行。根据代码内存内容，管理自己的寄存器，修改内存内容。响应中断命令的请求。

3.	寄存器：可以保存特定长度的数据，并用存入的数据做一些有意义的运算。（有些寄存器保存对系统有特殊意义的数据）

4.通用寄存器：EAX是一个32-bit寄存器。同时，它的低16-bit又可以通过AX这个名字来访问；AX又被分为高、低8-bit两部分，分别由AH和AL表示。（32-bit可分为高低16-bit，低位16-bit又可以分为高低8-bit）

  4.1	通用寄存器用于传送和暂存数据，可以参加算术逻辑运算 16位通用寄存器有 AX, BX, CX, DX, SI, DI, BP 32位通用寄存器有 EAX, EBX, ECX, EDX, ESI, EDI, EBP，ESI, EDI, EBP没有8-bit分组。（EAX, EBX, ECX, EDX, ESI, EDI通常以DS作为寄存器或段选择器，而EBP的默认寄存器或段选择器为SS）

•	EAX进行运算方面比较常用

•	EBX内存偏移指针

•	ECX特定指令的计数（计数器）

•	EDX 存放余数

•	ESI 源变址指针，寄存器（很少用）

•	EDI 目的变址指针

•	EBP 存取某时刻的栈顶指针（用于保存局部变量）

  4.2	段寄存器和选择器

•	CS代码段，或代码选择器（储存的代码受保护）

•	DS数据段，或数据选择器（可被装入任意数值）

•	ES，GS附加段，或附加选择器（存放附加数据段的基址）

•	SS 堆栈寄存器，栈底（可被装入任意数值）

4.3	特殊储存器

•	EIP 指令寄存器，存放下一条指令执行的地址

•	ESP 栈顶指针，存放当前活动的栈顶指针

4.4	标志储存器

仅占一位，用于反映处理器的状态和ALU运算结果的某些特征及控制指令的执行

4.5	其他储存器

	CR0、CR2、CR3（控制寄存器）。例如CR0的作用是切换实模式和保护模式。

D0、D1、D2、D3、D6和D7（调试寄存器），他们可以作为调试器的硬件支持来设置条件断点。

TR3、TR4、TR5、TR6、TR?寄存器（测试寄存器）用于某些条件测试。
