数制转换

二进制：用1和0两种数码来表示数，且逢2进1

八进制：用0~7共8个数码来表示数，且逢8进1

十进制：用0~9共10个数码来表示数，

十六进制：用0~9十个数码以及A-F对应10-15来表示数，且逢16进1

进制转换：  F（十六进制）=101+5=15（十进制）=81+7=17（八进制）=23+22+21+20=1111（二进制）

逻辑运算
•	与、或、非、异或的逻辑运算；
1.	与：& 称为逻辑与，只有两个操作数都是true，结果才是true。
2.	或：||称为逻辑或，只有全部操作数为false，结果才是 false。
3.	非："!"(逻辑非)逻辑运算符。"逻辑非"就是指本来值的反值。
4.	异或：逻辑符号一般用xor，也有用⊕，相反为真，相同为假。
•	明码，补码，反码的概念；
明码（原码）：符号位都是用0表示“正”，用1表示“负”，是一种计算机中对数字的二进制定点表示方法。
补码：正数的补码与其原码相同；负数的补码是在其反码的末位加1。
反码：正数的反码与其原码相同；负数的反码是对其原码逐位取反，但符号位除外。
初识密码学
•	明文，密文，秘钥，公钥，私钥，密钥空间的概念；
1.	明文：直接可以看懂得文字。例如：1234
2.	密文：密文是加了密的的文字，明文是加密之前的文字。
3.	秘钥（密钥）：是一种参数，它是在明文转换为密文或将密文转换为明文的算法中输入的参数。
4.	公钥和私钥：公钥（Public Key）与私钥（Private Key）是通过一种算法得到的一个密钥对（即一个公钥和一个私钥），公钥是密钥对中公开的部分，私钥则是非公开的部分。
5.	密钥空间：加密密钥大小的范围。当密钥长度为r时，密钥空间有2的r次方个元素。
•	凯撒密码，简单替换密码，换位密码，分组密码，对称密码与公钥密码，单向散列函数，消息认证码，数字签名，数字证书，伪随机数生成器的概念。
1.	凯撒密码：通过把字母移动一定的位数来实现加密和解密。若当偏移量是3，A-D   对明文DNF，加密后GQI。（向后移或者向前移字母位数）
2.	简单替换密码（单字母密码）：明文的一个字符用相应的一个密文字符代替，而且密文所用的字符与一般的明文所用字符属同一语言系统。（用其他字母代替这个字母）
3.	换位密码：打乱密码的顺序。
4.	分组密码：将明文消息编码表示后的数字序列，划分成长度为n的组，每组分别在密钥的控制下变换成等长的输出数字序列。
5.	对称密码：同一个密钥可以同时用作信息的加密和解密，这种加密方法称为对称加密，也称为单密钥加密。
6.	公钥密码：又称为非对称密码，有加密和解密，但不是用同一种方式。
7.	单向散列函数：把任意长的输入消息串变化成固定长的输出串且由输出串难以得到输入串的一种函数。
8.	消息认证码：就是用于验证消息的完整性的密码，验证当接收方收到发送方的报文时，接收方能够验证收到的报文是真实的和未被篡改的。
9.	数字签名：是一种类似写在纸上的普通的物理签名，但是使用了公钥加密领域的技术实现，用于鉴别数字信息的方法。
10.	数字证书：互联网通讯中标志通讯各方身份信息的一串数字。
11.	伪随机数发生器：在系统需要随机数的时候，通过一系列种子值计算出来的伪随机数。（随机数都是通过一定公式计算出来的）
